In [41]:
import pyodbc
import pandas as pd
import numpy as np
import os

In [54]:
os.chdir('C:\\Users\\hp\\Desktop\\ProFinch')
df=pd.DataFrame()
df=pd.read_excel("CustomerInfo4.xlsx")

In [55]:
df.columns

Index(['Unnamed: 0', 'Unnamed: 0.1', 'first_name', 'last_name', 'gender',
       'age', 'country', 'state', 'postal code', 'social security number',
       'company', 'job title', 'salary', 'card number', 'card type',
       'money_withdrawn_amount', 'money_withdrawn_reason',
       'money_withdrawn_location', 'Suspicious Activity', 'No.of Transactions',
       'money_withdrawn_date', 'money_withdrawn_date_only'],
      dtype='object')

# Start model/file reading section

In [33]:
def runsql(x):
    global data,df2
    conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
    query=x
    cursor = conx.cursor();
    cursor.execute(query);
    data = cursor.fetchall()
    q = pd.read_sql_query(query,conx)
    df2 = pd.DataFrame(q, columns=['first_name','last_name','social security number'])
    conx.close()

In [31]:
file1 = open('Rules.txt', 'r') 
Lines = file1.readlines() 
List=[]  
count = 0
# Strips the newline character 
for line in Lines: 
#     print(line.strip()) 
    print("Line{}: {}".format(count, line.strip()))
    count=count+1
    List.append(line.strip())

Line0: SELECT first_name,last_name,SUM(money_withdrawn_amount) AS money_withdrawn_amount FROM output2 GROUP BY first_name,last_name,money_withdrawn_date_only
Line1: SELECT [first_name],[last_name],[social security number] FROM [kk].[dbo].[output2] WHERE [No#of Transactions]*([money_withdrawn_amount])>=([salary])

In [50]:
for i in range(len(List)):
    runsql(List[i])
    print(df2.head())

ProgrammingError: ('42S22', "[42S22] [Microsoft][ODBC SQL Server Driver][SQL Server]Invalid column name 'money_withdrawn_date_only'. (207) (SQLExecDirectW)")

# End Section

# Adding people with mutiple transactions to invalidate rule1

In [27]:
'20120618 10:34:09'

'20120618 10:34:09'

In [15]:
string1="insert into output2 values('0.0','0.0','spider','tobey','Male',24,'United States','Colorado', 80935.0, '785-91-9407', 'Fiveclub', 'Actuary', 12000.0, 3558725889734886.0, 'jcb', 5000.0, 'Electronics', 'California', 'False',1.0,'20180618 10:34:09','06/18/20')"

In [16]:
string2="insert into output2 values('0.0','0.0','spider','tobey','Male',24,'United States','Colorado', 80935.0, '785-91-9407', 'Fiveclub', 'Actuary', 12000.0, 3558725889734886.0, 'jcb', 5000.0, 'Electronics', 'California', 'False',1.0,'20180618 10:40:00','06/18/20')"

In [17]:
string3="insert into output2 values('0.0','0.0','spider','tobey','Male',24,'United States','Colorado', 80935.0, '785-91-9407', 'Fiveclub', 'Actuary', 12000.0, 3558725889734886.0, 'jcb', 5000.0, 'Electronics', 'California', 'False',1.0,'20180618 10:45:00','06/18/20')"

In [18]:
string4="insert into output2 values('0.0','0.0','spider','andrew','Male',24,'United States','Colorado', 80935.0, '785-91-9407', 'Fiveclub', 'Actuary', 12000.0, 3558725889734886.0, 'jcb', 5000.0, 'Electronics', 'California', 'False',1.0,'20190618 10:40:00','06/18/19')"

In [19]:
string5="insert into output2 values('0.0','0.0','spider','andrew','Male',24,'United States','Colorado', 80935.0, '785-91-9407', 'Fiveclub', 'Actuary', 12000.0, 3558725889734886.0, 'jcb', 5000.0, 'Electronics', 'California', 'False',1.0,'20190618 10:55:00','06/18/19')"

In [37]:
# string_del="delete from output2 where first_name='spider'"

In [24]:
conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
query=string5
cursor = conx.cursor();
cursor.execute(query);
conx.commit();

In [25]:
conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
query="SELECT * FROM [kk].[dbo].[output2]"
cursor = conx.cursor();
cursor.execute(query);
data = cursor.fetchall()
q = pd.read_sql_query(query,conx)
df2 = pd.DataFrame(q, columns=['first_name','last_name','social security number','Suspicious Activity','money_withdrawn_date','money_withdrawn_amount'])
conx.close()

In [26]:
len(df2)

1005

In [54]:
for i in range(1001):
    if(df2['first_name'][i]=="spider"):
        print(df2['money_withdrawn_date'][i])
type(y)

2012-06-18 10:34:09
2012-06-18 10:34:09
2012-06-18 10:34:09

pandas._libs.tslibs.timestamps.Timestamp

In [73]:
df2['money_withdrawn_amount'][0]

6823.85

In [58]:
duplicateRowsDF = df2[df2.duplicated(['first_name','last_name','money_withdrawn_date'],keep=False)]

In [59]:
duplicateRowsDF

,first_name,last_name,social security number,Suspicious Activity,money_withdrawn_date,money_withdrawn_amount
543,spider,tobey,785-91-9407,False,2012-06-18 10:34:09,5000.0
544,spider,tobey,785-91-9407,False,2012-06-18 10:34:09,5000.0
545,spider,tobey,785-91-9407,False,2012-06-18 10:34:09,5000.0

In [76]:
duplicateRowsDF=duplicateRowsDF.reset_index()

In [78]:
money=0
for i in range(len(duplicateRowsDF)):
    money=money+duplicateRowsDF['money_withdrawn_amount'][i]
print(money)

15000.0

# Trying to get duplicates from db directly

In [36]:
string="select first_name,last_name,SUM(money_withdrawn_amount) AS money_withdrawn_amount FROM output2 GROUP BY first_name,last_name,money_withdrawn_date_only"

In [51]:
conx = pyodbc.connect('DRIVER={SQL Server}; SERVER=DESKTOP-V8F09K2\KRISHNASQL; Database=kk; UID=sa; PWD=pokemon;')
query="select * from output2"
cursor = conx.cursor();
cursor.execute(query);
data = cursor.fetchall()
q = pd.read_sql_query(query,conx)
df2 = pd.DataFrame(q, columns=df.columns)
conx.close()

In [53]:
data[:1]

[(0, 'Aaron', 'Skirrow', 27666.09)]

In [52]:
len(df2)

1002

In [39]:
df2

     first_name  last_name  money_withdrawn_amount
0         Aaron    Skirrow                27666.09
1          Abbe   Kauscher                21781.18
2         Abram     Vinton                 7907.31
3      Adelheid  Gainforth                 7428.40
4      Adelheid     Sackur                 6168.47
...         ...        ...                     ...
997    Zaccaria       Thow                14293.09
998         Zak     Shimon                 7433.32
999     Zebedee     Hartup                18727.14
1000      Zenia   Patience                15167.04
1001      Zorah       Pill                28884.40

[1002 rows x 3 columns]

# Replacing table with updated table

In [44]:
import urllib
import sqlalchemy
conn_str = (
    r'Driver={SQL Server};'
    r'Server=DESKTOP-V8F09K2\KRISHNASQL;'
    r'Database=kk;'
    r'UID=sa;'
    r'PWD=pokemon;'
)
quoted_conn_str = urllib.parse.quote_plus(conn_str)
engine = sqlalchemy.create_engine('mssql+pyodbc:///?odbc_connect={}'.format(quoted_conn_str))
cnxn = engine.connect()

In [45]:
rows = cnxn.execute("SELECT name FROM sys.tables").fetchall()
print(rows)

[('output',), ('fraud_names',), ('output2',)]

In [46]:
df2.to_sql('output2', con=engine,if_exists='replace')

# End section

In [30]:
for i in range(len(df2)):
    if(df2['first_name'][i]=="spider"):
        print(df2['money_withdrawn_amount'][i])

10000.0
15000.0